README.md
```mermaid
sequenceDiagram
    autonumber
    participant HIS
    participant ROIS
    participant TMS
    participant OST

    Note over HIS,OST: Patient Registration
    HIS->>ROIS: (external) Sync Patient Demographics: HL7v2 ADT
    ROIS->>ROIS: Assign Patient to TMS
    ROIS->>TMS: Sync Patient Demographics: HL7v2 ADT [ITI-30]
    alt photo by reference
        ROIS->>TMS: Sync Patient Photo [RO-SMRT-01] (FHIR, refs SC Image)
        TMS->>OST: Retrieve Patient Photo (DICOM)
    else photo by value
        ROIS->>TMS: Sync Patient Photo [RO-SMRT-01] (FHIR, Base64 image)
    end
    opt
        ROIS->>TMS: Sync Treatment Encounter: HL7v2 ADT [ITI-31]
    end

    Note over HIS,OST: Appointment Scheduling
    opt
        ROIS->>ROIS: Create Intent (site, modality, dose, fractions)
    end
    ROIS->>ROIS: Schedule Treatment Appointments
    ROIS->>TMS: Sync Treatment Appointment: HL7v2 SIU

    Note over HIS,OST: Treatment Planning
    opt Support Prescription Option (beyond MVP)
        ROIS->>ROIS: Create Prescription
        TMS->>ROIS: Retrieve Prescription Summary [XRTS-08]
    end
    alt approved plan
        TMS->>TMS: Import approved treatment plan
    else unapproved plan
        TMS->>TMS: Import plan & Approve
    end
    TMS->>TMS: Enrich Plan
    TMS->>ROIS: Report Planning Artifacts [RO-SMRT-02] (FHIR, refs DICOM)
    ROIS->>OST: Retrieve Planning Artefacts (RTP,[CT],[RTS],[RTD]): DICOM

    Note over HIS,OST: Approve for Treatment
    ROIS->>ROIS: Approve Treatment
    ROIS->>TMS: Report Treatment Approval [RO-SMRT-03] (FHIR)
    TMS->>TMS: Add Approval to Plan
    TMS->>ROIS: Report Planning Artifacts [RO-SMRT-02] (final delivery plan)
    ROIS->>OST: Retrieve Planning Artefacts (RTP): DICOM

    Note over HIS,OST: Treatment Delivery
    ROIS->>TMS: Report Patient Check-in: HL7v2 SIU
    TMS->>TMS: Deliver Treatment

    Note over HIS,OST: Report Treatment Artifacts
    TMS->>ROIS: Report Treatment Artifacts [RO-SMRT-04] (FHIR, refs DICOM: RT Record, RTSTRUCT, CT, RTDOSE)
    ROIS->>OST: Retrieve Treatment Artefacts (RT Record,[Image],[SRO]): DICOM
    ROIS->>ROIS: Track Treatment Progress

    Note over HIS,OST: Post-Treatment Activities
    alt image review at TMS
        TMS->>ROIS: Report Image Review Results [RO-SMRT-05] (FHIR)
    else image review at ROIS
        ROIS->>ROIS: Review Images
    end
    ROIS->>HIS: (external) Share Treatment Summary: XRTS/HL7v2 ORU
    ROIS->>HIS: (external) Billing: HL7v2 DFT
```
